@echo off
setlocal enabledelayedexpansion

:: ==============================================
:: 初始化 MSVC 编译环境
:: ==============================================
call "C:\WorkDir\Software\vs2019\VC\Auxiliary\Build\vcvars64.bat"

:: ==============================================
:: 清理并重建 01_KMP 构建目录
:: ==============================================
if exist "01_KMP\build" (
    echo 正在删除旧的 01_KMP 构建目录...
    rmdir /s /q "01_KMP\build"
)
mkdir "01_KMP\build"

:: ==============================================
:: 使用 CMake 配置项目
:: ==============================================
cd "01_KMP\build"
cmake -S .. -B . -DCMAKE_BUILD_TYPE=Release

:: ==============================================
:: 编译项目
:: ==============================================
cmake --build . --config Release

pause 